Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Skip the :ref:`check-fluent-target-inner-html` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-target-inner-html`.

source: Skip the :ref:`check-fluent-target-syntax` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-target-syntax`.

source: Skip the :ref:`check-angularjs-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-angularjs-format`.

source: Skip the :ref:`check-automattic-components-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-automattic-components-format`.

source: Skip the :ref:`check-c-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-c-format`.

source: Skip the :ref:`check-c-sharp-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-c-sharp-format`.

source: Skip the :ref:`check-es-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-es-format`.

source: Skip the :ref:`check-i18next-interpolation` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-i18next-interpolation`.

source: Skip the :ref:`check-icu-message-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-icu-message-format`.

source: Skip the :ref:`check-java-printf-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-java-printf-format`.

source: Skip the :ref:`check-java-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-java-format`.

source: Skip the :ref:`check-javascript-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-javascript-format`.

source: Skip the :ref:`check-lua-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-lua-format`.

source: Skip the :ref:`check-object-pascal-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-object-pascal-format`.

source: Skip the :ref:`check-percent-placeholders` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-percent-placeholders`.

source: Skip the :ref:`check-perl-brace-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-perl-brace-format`.

source: Skip the :ref:`check-perl-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-perl-format`.

source: Skip the :ref:`check-php-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-php-format`.

source: Skip the :ref:`check-python-brace-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-python-brace-format`.

source: Skip the :ref:`check-python-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-python-format`.

source: Skip the :ref:`check-qt-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-qt-format`.

source: Skip the :ref:`check-qt-plural-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-qt-plural-format`.

source: Skip the :ref:`check-ruby-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-ruby-format`.

source: Skip the :ref:`check-scheme-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-scheme-format`.

source: Skip the :ref:`check-vue-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-vue-format`.

source: Skip the :ref:`check-translated` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-translated`.

source: Skip the :ref:`check-inconsistent` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-inconsistent`.

source: Skip the :ref:`check-rst-references` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-rst-references`.

source: Skip the :ref:`check-kashida` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-kashida`.

source: Skip the :ref:`check-md-link` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-md-link`.

source: Skip the :ref:`check-md-reflink` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-md-reflink`.

source: Skip the :ref:`check-md-syntax` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-md-syntax`.

source: Skip the :ref:`check-max-length` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-max-length`.

source: Skip the :ref:`check-max-size` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-max-size`.

source: Skip the :ref:`check-escaped-newline` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-escaped-newline`.

source: Skip the :ref:`check-end-colon` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-colon`.

source: Skip the :ref:`check-end-ellipsis` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-ellipsis`.

source: Skip the :ref:`check-end-exclamation` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-exclamation`.

source: Skip the :ref:`check-end-stop` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-stop`.

source: Skip the :ref:`check-end-interrobang` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-interrobang`.

source: Skip the :ref:`check-end-question` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-question`.

source: Skip the :ref:`check-end-semicolon` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-semicolon`.

source: Skip the :ref:`check-newline-count` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-newline-count`.

source: Skip the :ref:`check-plurals` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-plurals`.

source: Skip the :ref:`check-kabyle-characters` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-kabyle-characters`.

source: Skip the :ref:`check-placeholders` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-placeholders`.

source: Skip the :ref:`check-prohibited-initial-character` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-prohibited-initial-character`.

source: Skip the :ref:`check-punctuation-spacing` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-punctuation-spacing`.

source: Skip the :ref:`check-regex` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-regex`.

source: Skip the :ref:`check-rst-syntax` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-rst-syntax`.

source: Skip the :ref:`check-reused` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-reused`.

source: Skip the :ref:`check-same-plurals` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-same-plurals`.

source: Skip the :ref:`check-begin-newline` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-begin-newline`.

source: Skip the :ref:`check-begin-space` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-begin-space`.

source: Skip the :ref:`check-end-newline` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-newline`.

source: Skip the :ref:`check-end-space` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-end-space`.

source: Skip the :ref:`check-same` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-same`.

source: Skip the :ref:`check-safe-html` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-safe-html`.

source: Skip the :ref:`check-url` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-url`.

source: Skip the :ref:`check-xml-tags` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-xml-tags`.

source: Skip the :ref:`check-xml-invalid` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-xml-invalid`.

source: Skip the :ref:`check-zero-width-space` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-zero-width-space`.

source: Skip the :ref:`check-ellipsis` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-ellipsis`.

source: Skip the :ref:`check-fluent-source-inner-html` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-source-inner-html`.

source: Skip the :ref:`check-fluent-source-syntax` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-fluent-source-syntax`.

source: Skip the :ref:`check-icu-message-format-syntax` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-icu-message-format-syntax`.

source: Skip the :ref:`check-long-untranslated` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-long-untranslated`.

source: Skip the :ref:`check-multiple-failures` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-multiple-failures`.

source: Skip the :ref:`check-unnamed-format` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-unnamed-format`.

source: Skip the :ref:`check-optional-plural` quality check.
sv: Hoppa Ã¶ver kvalitetskontrollen :ref:`check-optional-plural`.

source: Generally the rule is named ``ignore-*`` for any check, using its identifier, so you can use this even for your custom checks.
sv: Generellt sett heter regeln ``ignore-*`` fÃ¶r alla kontroller, med hjÃ¤lp av dess identifierare, sÃ¥ du kan anvÃ¤nda detta Ã¤ven fÃ¶r dina egna kontroller.

source: These flags are understood both in :ref:`component` settings, per source string settings and in the translation file itself (for example in GNU gettext).
sv: Dessa flaggor fÃ¶rstÃ¥s bÃ¥de i :ref:`component`-instÃ¤llningar, per kÃ¤llstrÃ¤nginstÃ¤llningar och i sjÃ¤lva Ã¶versÃ¤ttningsfilen (till exempel i GNU gettext).

source: Location-based flags
sv: Platsbaserade flaggor

source: Some flags are added to strings by default, based on their locations. This means that certain checks will be automatically enabled depending on where the string is used.
sv: Vissa flaggor lÃ¤ggs till i strÃ¤ngar som standard, baserat pÃ¥ deras placering. Detta innebÃ¤r att vissa kontroller aktiveras automatiskt beroende pÃ¥ var strÃ¤ngen anvÃ¤nds.

source: ``rst-text``: This flag is automatically added to strings in reStructuredText files, if location extension is ``.rst``.
sv: ``rst-text``: Denna flagga lÃ¤ggs automatiskt till strÃ¤ngar i reStructuredText-filer om platsfÃ¶rlÃ¤ngningen Ã¤r ``.rst``.

source: ``md-text``: This flag is automatically added to strings in Markdown files, if location extension is ``.md`` or ``.markdown``.
sv: ``md-text``: Denna flagga lÃ¤ggs automatiskt till strÃ¤ngar i Markdown-filer om platsfÃ¶rlÃ¤ngningen Ã¤r ``.md`` eller ``.markdown``.

source: Enforcing checks
sv: GenomfÃ¶rande av kontroller

source: The enforced checks cannot be dismissed and mark string as :guilabel:`Needs editing` (see :ref:`states`). This prevents translators from hiding such checks.
sv: De tvingande kontrollerna kan inte ignoreras och markera strÃ¤ngen som :guilabel:`BehÃ¶ver redigeras` (se :ref:`states`). Detta fÃ¶rhindrar Ã¶versÃ¤ttare frÃ¥n att dÃ¶lja sÃ¥dana kontroller.

source: Turning on check enforcing doesn't enable it automatically. Some checks have to be turned on by adding the corresponding flag to the string or component flags.
sv: Att aktivera kontrollen aktiverar den inte automatiskt. Vissa kontroller mÃ¥ste aktiveras genom att lÃ¤gga till motsvarande flagga till strÃ¤ng- eller komponentflaggorna.

source: This is best used with checks that can cause serious issues when used like checks for :ref:`check-formats`. Using for style checks like :ref:`check-same` is not recommended because dismissal is sometimes a reasonable approach in these.
sv: Detta anvÃ¤nds bÃ¤st med kontroller som kan orsaka allvarliga problem nÃ¤r de anvÃ¤nds, sÃ¥som kontroller fÃ¶r :ref:`check-formats`. Det rekommenderas inte att anvÃ¤nda detta fÃ¶r stilkontroller som :ref:`check-same`, eftersom det ibland Ã¤r rimligt att avfÃ¤rda dessa.

source: The :ref:`project-commit_policy` can then be used to exclude strings needing editing from being committed to the version control.
sv: :ref:`project-commit_policy` kan sedan anvÃ¤ndas fÃ¶r att undanta strÃ¤ngar som behÃ¶ver redigeras frÃ¥n att lÃ¤ggas in i versionshanteringen.

source: Managing fonts
sv: Hantera teckensnitt

source: Fonts uploaded into Weblate are used purely for purposes of the :ref:`check-max-size` check, they do not have an effect in Weblate user interface.
sv: Typsnitt som laddas upp till Weblate anvÃ¤nds enbart fÃ¶r :ref:`check-max-size`-kontrollen och har ingen inverkan pÃ¥ Weblates anvÃ¤ndargrÃ¤nssnitt.

source: The :ref:`check-max-size` check used to calculate dimensions of the rendered text needs font to be loaded into Weblate and selected using a translation flag (see :ref:`custom-checks`).
sv: Kontrollen :ref:`check-max-size` som anvÃ¤nds fÃ¶r att berÃ¤kna dimensionerna fÃ¶r den renderade texten krÃ¤ver att teckensnittet laddas in i Weblate och vÃ¤ljs med hjÃ¤lp av en Ã¶versÃ¤ttningsflagga (se :ref:`custom-checks`).

source: Weblate font management tool in :guilabel:`Fonts` under the :guilabel:`Operations` menu of your translation project provides interface to upload and manage fonts. TrueType or OpenType fonts can be uploaded, set up font-groups and use those in the check.
sv: Weblate-verktyget fÃ¶r typsnittshantering i :guilabel:`Fonts` under menyn :guilabel:`Operations` i ditt Ã¶versÃ¤ttningsprojekt erbjuder ett grÃ¤nssnitt fÃ¶r att ladda upp och hantera typsnitt. TrueType- eller OpenType-typsnitt kan laddas upp, typsnittsgrupper kan skapas och dessa kan anvÃ¤ndas i kontrollen.

source: The font-groups allow you to define different fonts for different languages, which is typically needed for non-latin languages:
sv: Med teckensnittsgrupperna kan du definiera olika teckensnitt fÃ¶r olika sprÃ¥k, vilket vanligtvis behÃ¶vs fÃ¶r icke-latinska sprÃ¥k:

source: The font-groups are identified by name, which can not contain whitespace or special characters, so that it can be easily used in the check definition:
sv: Fontgrupperna identifieras med namn, som inte fÃ¥r innehÃ¥lla blanktecken eller specialtecken, sÃ¥ att de enkelt kan anvÃ¤ndas i kontrolldefinitionen:

source: Font-family and style is automatically recognized after uploading them:
sv: Fontfamilj och stil kÃ¤nns igen automatiskt efter uppladdning:

source: You can have a number of fonts loaded into Weblate:
sv: Du kan ladda ett antal typsnitt i Weblate:

source: To use the fonts for checking the string length, pass it the appropriate flags (see :ref:`custom-checks`). You will probably need the following ones:
sv: FÃ¶r att anvÃ¤nda teckensnitten fÃ¶r att kontrollera strÃ¤nglÃ¤ngden, skicka lÃ¤mpliga flaggor (se :ref:`custom-checks`). Du kommer troligen att behÃ¶va fÃ¶ljande:

source: Defines maximal width in pixels and, optionally, the maximum number of lines (word wrapping is applied).
sv: Definierar maximal bredd i pixlar och, valfritt, maximalt antal rader (ordbrytning tillÃ¤mpas).

source: Defines font group to use by specifying its identifier.
sv: Definierar vilken teckensnittsgrupp som ska anvÃ¤ndas genom att ange dess identifierare.

source: Defines font size in pixels.
sv: Definierar teckenstorlek i pixlar.

source: Writing own checks
sv: Skriva egna checkar

source: A wide range of quality checks are built-in, (see :ref:`checks`), though they might not cover everything you want to check. The list of performed checks can be adjusted using :setting:`CHECK_LIST`, and you can also add custom checks.
sv: Ett brett utbud av kvalitetskontroller Ã¤r inbyggda (se :ref:`checks`), men de tÃ¤cker kanske inte allt du vill kontrollera. Listan Ã¶ver utfÃ¶rda kontroller kan justeras med :setting:`CHECK_LIST`, och du kan ocksÃ¥ lÃ¤gga till egna kontroller.

source: Subclass the `weblate.checks.Check`
sv: Underklass till `weblate.checks.Check`

source: Set a few attributes.
sv: StÃ¤ll in nÃ¥gra attribut.

source: Implement either the ``check`` (if you want to deal with plurals in your code) or the ``check_single`` method (which does it for you).
sv: Implementera antingen metoden ``check`` (om du vill hantera pluralformer i din kod) eller metoden ``check_single`` (som gÃ¶r det Ã¥t dig).

source: Some examples:
sv: NÃ¥gra exempel:

source: To install custom checks, provide a fully-qualified path to the Python class in the :setting:`CHECK_LIST`, see :ref:`custom-check-modules`.
sv: FÃ¶r att installera anpassade kontroller, ange en fullstÃ¤ndig sÃ¶kvÃ¤g till Python-klassen i :setting:`CHECK_LIST`, se :ref:`custom-check-modules`.

source: Checking translation text does not contain "foo"
sv: Kontrollerar att Ã¶versÃ¤ttningstexten inte innehÃ¥ller "foo"

source: This is a pretty simple check which just checks whether the translation is missing the string "foo".
sv: Detta Ã¤r en ganska enkel kontroll som bara kontrollerar om Ã¶versÃ¤ttningen saknar strÃ¤ngen "foo".

source: Checking that Czech translation text plurals differ
sv: Kontrollera att pluralformer i den tjeckiska Ã¶versÃ¤ttningen skiljer sig Ã¥t

source: Check using language info to verify the two plural forms in Czech language are not same.
sv: Kontrollera med hjÃ¤lp av sprÃ¥kinformationen att de tvÃ¥ pluralformerna pÃ¥ tjeckiska inte Ã¤r identiska.

source: Component Lists
sv: Komponentlistor

source: Specify multiple lists of components to appear as options on the user dashboard, from which users can pick one as their default view. See :ref:`dashboard` to learn more.
sv: Ange flera listor med komponenter som ska visas som alternativ pÃ¥ anvÃ¤ndarens instrumentpanel, frÃ¥n vilka anvÃ¤ndarna kan vÃ¤lja en som standardvy. Se :ref:`dashboard` fÃ¶r mer information.

source: A status will be presented for each component list presented on the dashboard.
sv: En status kommer att visas fÃ¶r varje komponentlista som presenteras pÃ¥ instrumentpanelen.

source: The names and content of component lists can be specified in the admin interface, in :guilabel:`Component lists` section. Each component list must have a name that is displayed to the user, and a slug representing it in the URL.
sv: Namnen och innehÃ¥llet i komponentlistorna kan anges i administratÃ¶rsgrÃ¤nssnittet, i avsnittet :guilabel:`Komponentlistor`. Varje komponentlista mÃ¥ste ha ett namn som visas fÃ¶r anvÃ¤ndaren och en slug som representerar den i URL:en.

source: Change dashboard settings for anonymous users from the admin interface, altering what dashboard is presented to unauthenticated users.
sv: Ãndra instÃ¤llningarna fÃ¶r instrumentpanelen fÃ¶r anonyma anvÃ¤ndare frÃ¥n administratÃ¶rsgrÃ¤nssnittet och Ã¤ndra vilken instrumentpanel som visas fÃ¶r oautentiserade anvÃ¤ndare.

source: Automatic component lists
sv: Automatiska komponentlistor

source: Add components to the list automatically based on their slug by creating :guilabel:`Automatic component list assignment` rules.
sv: LÃ¤gg till komponenter i listan automatiskt baserat pÃ¥ deras slug genom att skapa :guilabel:`Automatisk komponentlisttilldelning`-regler.

source: Useful for maintaining component lists for large installations, or in case you want to have one component list with all components on your Weblate installation.
sv: AnvÃ¤ndbart fÃ¶r att underhÃ¥lla komponentlistor fÃ¶r stora installationer, eller om du vill ha en komponentlista med alla komponenter i din Weblate-installation.

source: Make a component list containing all the components of your Weblate installation.
sv: Skapa en komponentlista som innehÃ¥ller alla komponenter i din Weblate-installation.

source: 1. Define :guilabel:`Automatic component list assignment` with ``^.*$`` as regular expression in both the project and the component fields, as shown on this image:
sv: 1. Definiera :guilabel:`Automatisk komponentlisttilldelning` med ``^.*$`` som reguljÃ¤rt uttryck i bÃ¥de projekt- och komponentfÃ¤lten, som visas pÃ¥ denna bild:

source: Image showing the Weblate administration panel with the above configuration filled in.
sv: Bild som visar Weblate-administrationspanelen med ovanstÃ¥ende konfiguration ifylld.

source: All settings are stored in :file:`settings.py` (as is usual for Django).
sv: Alla instÃ¤llningar sparas i :file:`settings.py` (som vanligt fÃ¶r Django).

source: After changing any of these settings, you need to restart Weblate â both WSGI and Celery processes.
sv: Efter att ha Ã¤ndrat nÃ¥gon av dessa instÃ¤llningar mÃ¥ste du starta om Weblate â bÃ¥de WSGI- och Celery-processerna.

source: In case it is run as ``mod_wsgi``, you need to restart Apache to reload the configuration.
sv: Om det kÃ¶rs som ``mod_wsgi`` mÃ¥ste du starta om Apache fÃ¶r att ladda om konfigurationen.

source: Please also check :doc:`Django's documentation <django:ref/settings>` for parameters configuring Django itself.
sv: Se Ã¤ven :doc:`Djangos dokumentation <django:ref/settings>` fÃ¶r parametrar som konfigurerar Django sjÃ¤lv.

source: Configures where contact form sends e-mails. If not configured, e-mail addresses from :setting:`ADMINS` are used.
sv: Konfigurerar vart kontaktformulÃ¤ret skickar e-postmeddelanden. Om det inte Ã¤r konfigurerat anvÃ¤nds e-postadresser frÃ¥n :setting:`ADMINS`.

source: Configure this as a list of e-mail addresses:
sv: Konfigurera detta som en lista med e-postadresser:

source: Configures which domains are allowed for fetching assets in Weblate.
sv: Konfigurerar vilka domÃ¤ner som Ã¤r tillÃ¥tna fÃ¶r hÃ¤mtning av tillgÃ¥ngar i Weblate.

source: This enhances security by preventing loading assets from untrusted sources. Assets are downloaded once by the Weblate server and stored locally, rather than being served directly from external domains to users.
sv: Detta fÃ¶rbÃ¤ttrar sÃ¤kerheten genom att fÃ¶rhindra att tillgÃ¥ngar laddas frÃ¥n opÃ¥litliga kÃ¤llor. TillgÃ¥ngarna laddas ner en gÃ¥ng av Weblate-servern och lagras lokalt, istÃ¤llet fÃ¶r att levereras direkt frÃ¥n externa domÃ¤ner till anvÃ¤ndarna.

source: It expects a list of host/domain names. You can use fully qualified names (e.g ``www.example.com``) or prepend with a period as a wildcard to match all subdomains (e.g ``.example.com`` will match ``cdn.example.com`` or ``static.example.com``).
sv: Den fÃ¶rvÃ¤ntar sig en lista med vÃ¤rd-/domÃ¤nnamn. Du kan anvÃ¤nda fullstÃ¤ndiga namn (t.ex. ``www.example.com``) eller lÃ¤gga till en punkt som jokertecken fÃ¶r att matcha alla underdomÃ¤ner (t.ex. ``.example.com`` matchar ``cdn.example.com`` eller ``static.example.com``).

source: Defaults to `[*]` which will allow all domains.
sv: StandardinstÃ¤llningen Ã¤r `[*]`, vilket tillÃ¥ter alla domÃ¤ner.

source: **Example**
sv: **Exempel**

source: This is currently used in the following places:
sv: Detta anvÃ¤nds fÃ¶r nÃ¤rvarande pÃ¥ fÃ¶ljande platser:

source: Screenshot uploads, see :ref:`screenshots`
sv: SkÃ¤rmdumpsuppladdningar, se :ref:`screenshots`

source: Configures size limit for fetching assets in Weblate. Defaults to 4 MB.
sv: Konfigurerar storleksbegrÃ¤nsningen fÃ¶r hÃ¤mtning av tillgÃ¥ngar i Weblate. StandardvÃ¤rdet Ã¤r 4 MB.

source: Configures a maximal number for ALTCHA proof-of-work mechanism.
sv: Konfigurerar ett maximalt antal fÃ¶r ALTCHA-mekanismen fÃ¶r bevis pÃ¥ arbete.

source: Username of users that are not signed in.
sv: AnvÃ¤ndarnamn fÃ¶r anvÃ¤ndare som inte Ã¤r inloggade.

source: The maximum number of days Weblate will keep audit logs containing information about the account activity.
sv: Det maximala antalet dagar som Weblate sparar granskningsloggar med information om kontoaktiviteten.

source: Defaults to 180 days.
sv: StandardinstÃ¤llningen Ã¤r 180 dagar.

source: Maximum number of failed authentication attempts before rate limiting is applied.
sv: Maximalt antal misslyckade autentiseringsfÃ¶rsÃ¶k innan hastighetsbegrÃ¤nsning tillÃ¤mpas.

source: This is currently applied in the following locations:
sv: Detta tillÃ¤mpas fÃ¶r nÃ¤rvarande pÃ¥ fÃ¶ljande platser:

source: Sign in. Deletes the account password, preventing the user from signing in without requesting a new password.
sv: Logga in. Tar bort kontots lÃ¶senord, vilket fÃ¶rhindrar anvÃ¤ndaren frÃ¥n att logga in utan att begÃ¤ra ett nytt lÃ¶senord.
